# AddBarGeometry Method (IList(Curve)) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarTrimExtendData..::..AddBarGeometry Method (IList<(Of <(<'Curve>)>)>)
RebarTrimExtendData Class See Also
---
Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public RebarFreeFormValidationResult AddBarGeometry(
	IList<Curve> curves
)
```

Visual Basic
---
```text
Public Function AddBarGeometry ( _
	curves As IList(Of Curve) _
) As RebarFreeFormValidationResult
```

Visual C++
---
```text
public:
RebarFreeFormValidationResult AddBarGeometry(
	IList<Curve^>^ curves
)
```

# ### Parameters
curves
    Type: System.Collections.Generic..::..IList<(Of <(<'Curve>)>)> Curves describing one bar in the set.
# ### Return Value
Returns Success if everything is ok, otherwise the failure reason.
# Remarks
This function will can fail due to following reasons:
  * One or more of the input curves was null.
  * One or more of the input curves was unbounded.
  * Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
  * A rebar constructed from curves can't be bent according to the bending radius.

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Incorrect number of bar geometry. |

# See Also
RebarTrimExtendData Class
AddBarGeometry Overload
Autodesk.Revit.DB.Structure Namespace